# Pandas

## Task 1

You should import the necessary libraries. You will use `numpy` and `pandas` libraries.


> Don't forget to import `numpy`, and `pandas` in short form.

In [3]:
import numpy as np
import pandas as pd
from numpy.ma.core import multiply, power

## Task 2

Create a `DataFrame` from the given dictionary `data`.

In [7]:
data = {
    "Name": ["John", "Emily", "Ryan"],
    "Age": [16, 28, 22],
    "City": ["New York", "Los Angeles", "Chicago"],
}

df = pd.DataFrame(data)
df

    Name  Age         City
0   John   16     New York
1  Emily   28  Los Angeles
2   Ryan   22      Chicago

## Task 3

In this task you should complete the following steps:

### Task 3.1
Display all data for `Age` column for the DataFrame you created in the previous task.

In [8]:
df["Age"]

0    16
1    28
2    22
Name: Age, dtype: int64

### Task 3.2

Add `Salary` column to the `DataFrame` with the values `[50000, 60000, 45000]`.

In [9]:
df["Salary"] = [50000, 60000, 45000]
df["Salary"]

0    50000
1    60000
2    45000
Name: Salary, dtype: int64

### Task 3.3

Filter the `DataFrame` to show only the rows with the `Age` greater than 18.

In [10]:
df_filter = df[df["Age"] > 18]
df_filter

    Name  Age         City  Salary
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

## Task 4

In this task you should complete the following steps:

### Task 4.1

Add new calculated field `Birth year`;

In [11]:
from datetime import datetime
current_year = datetime.now().year
df["Birth year"] = current_year - df["Age"]
df

    Name  Age         City  Salary  Birth year
0   John   16     New York   50000        2008
1  Emily   28  Los Angeles   60000        1996
2   Ryan   22      Chicago   45000        2002

### Task 4.2

Add new calculated field `Average age`.

In [13]:
df["Average age"] = df["Age"].mean()
df

    Name  Age         City  Salary  Birth year  Avarage age  Average age
0   John   16     New York   50000        2008         22.0         22.0
1  Emily   28  Los Angeles   60000        1996         22.0         22.0
2   Ryan   22      Chicago   45000        2002         22.0         22.0

### Task 4.3

Calculate absolute difference between `Age` and `Average age`.

In [14]:
df["ABS"] = (df["Age"] - df["Average age"]).abs()
df

    Name  Age         City  Salary  Birth year  Avarage age  Average age  ABS
0   John   16     New York   50000        2008         22.0         22.0  6.0
1  Emily   28  Los Angeles   60000        1996         22.0         22.0  6.0
2   Ryan   22      Chicago   45000        2002         22.0         22.0  0.0

## Task 5

Complete the following tasks described below.

### Task 5.1

You have two dictionaries `data1` and `data2`. Create two `DataFrame` objects from these dictionaries. Then, `concatenate`, and `merge` these two `DataFrame` objects into one `DataFrame` object, and see the difference.

In [16]:
# Data
data1 = {'Name': ['John', 'Emily', 'Ryan'],
         'Age': [25, 28, 22]}
data2 = {'Name': ['Emily', 'Ryan', 'Mike'],
         'City': ['Los Angeles', 'Chicago', 'Houston']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1

    Name  Age
0   John   25
1  Emily   28
2   Ryan   22

In [19]:
merge_df = pd.merge(df1, df2, how='inner')
merge_df

    Name  Age         City
0  Emily   28  Los Angeles
1   Ryan   22      Chicago

In [21]:
concat_df = pd.concat([df1, df2], ignore_index=True)
concat_df

    Name   Age         City
0   John  25.0          NaN
1  Emily  28.0          NaN
2   Ryan  22.0          NaN
3  Emily   NaN  Los Angeles
4   Ryan   NaN      Chicago
5   Mike   NaN      Houston

### Task 5.2

You have two `Series` objects `s1` and `s2`. Make default mathematical operations on these two `Series` objects. Such as `+`, `-`, `*`, `/`, `**`, `//`, `%`. Also, filter `s1` and print only even numbers, and `s2` only with odd numbers.

In [23]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])

In [24]:
sum_s = s1 + s2
sum_s

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [25]:
min_s = s1 - s2
min_s

0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

In [26]:
multiply_s = s1 * s2
multiply_s

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [27]:
devide_s = s1 / s2
devide_s

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

In [28]:
power_s = s1.pow(s2)
power_s

0          1
1        128
2       6561
3     262144
4    9765625
dtype: int64

In [29]:
result_s = s2.floordiv(s1)
result_s

0    6
1    3
2    2
3    2
4    2
dtype: int64

In [30]:
mod_s = s2.mod(s1)
mod_s

0    0
1    1
2    2
3    1
4    0
dtype: int64

In [31]:
filtered_s = s1[s1 % 2 == 0]
filtered_s

1    2
3    4
dtype: int64

In [32]:
filtered_s2 = s2[s2 % 2 == 0]
filtered_s2

0     6
2     8
4    10
dtype: int64

### Task 5.3

You have a `Serias` object `s`. Make the following operations on this `Series` object:

* make all words in uppercase without loops;
* get length of each word without loops.

In [34]:
s = pd.Series(["numpy", "pandas", "matplotlib"])
s

0         numpy
1        pandas
2    matplotlib
dtype: object

In [35]:
uppercased = s.str.upper()
uppercased

0         NUMPY
1        PANDAS
2    MATPLOTLIB
dtype: object

In [36]:
lengths = s.str.len()
lengths

0     5
1     6
2    10
dtype: int64

## Task 6 Optional

You have a large dataset consisting of a series of numbers. Your task is to calculate the moving average of the series using a window of `5` elements. The moving average is the average of a set of consecutive values in the series, where the window `slides` through the series to compute the average at each position. The goal is to calculate the moving average efficiently and accurately. Also, compare time performance of Python and Pandas solutions.

> Please, note: If you get `nan` while calculating the moving average, you should remove it from the result. Pandas solution should take 1-2 lines of code.

### Python Solution

In the Python solution, a large dataset is generated using random numbers. The moving average is computed by iterating over the dataset using a loop. At each position, a window of 5 elements is created, and the average is calculated by summing the values in the window and dividing by 5.

In [5]:
import random

def unknown_signature():
    # Generate a large dataset
    data = [random.randint(1, 100) for _ in range(10000000)]

    # Calculate the moving average with a window of 5
    moving_averages = []
    for i in range(4, len(data)):
        window = data[i - 4 : i + 1]
        average = sum(window) / 5
        moving_averages.append(average)
    return moving_averages[:10]

%time unknown_signature()

CPU times: total: 4.16 s
Wall time: 5.69 s

[65.4, 55.6, 54.0, 52.2, 40.4, 21.8, 34.0, 37.8, 42.2, 55.0]

### Solution using Pandas and Numpy

In [7]:
def moving_average():
    data = np.random.randint(1, 100, size=10000000)
    df = pd.DataFrame(data, columns=["values"])
    moving_averages = df["values"].rolling(window=5).mean().dropna()
    return moving_averages.head(10)

%time moving_average()

CPU times: total: 375 ms
Wall time: 414 ms

4     38.2
5     43.2
6     44.2
7     46.6
8     55.8
9     65.2
10    55.8
11    57.2
12    57.4
13    48.6
Name: values, dtype: float64